; domain
(define (domain logistics)
(:requirements :factored-privacy :typing)
(:types 	location vehicle package city - object
	airport - location
	truck airplane - vehicle
)

(:predicates (at ?obj - object ?loc - location)
	(in ?obj1 - package ?veh - vehicle)
	(in-city ?agent - truck ?loc - location ?city - city)
)

(:action load-airplane
	:parameters     (?airplane - airplane ?obj - package ?loc - airport)
	:precondition   (and (at ?obj ?loc) (at ?airplane ?loc))
	:effect         (and (in ?obj ?airplane) (not (at ?obj ?loc)))
)

(:action unload-airplane
	:parameters     (?airplane - airplane ?obj - package ?loc - airport)
	:precondition   (and (in ?obj ?airplane) (at ?airplane ?loc))
	:effect         (and (at ?obj ?loc) (not (in ?obj ?airplane)))
)

(:action fly-airplane
	:parameters     (?airplane - airplane ?loc-from - airport ?loc-to - airport)
	:precondition   (and )
	:effect         (and (at ?airplane ?loc-to) (not (at ?airplane ?loc-from)))
)

(:action load-truck
	:parameters     (?truck - truck ?obj - package ?loc - location)
	:precondition   (and (at ?truck ?loc) (at ?obj ?loc))
	:effect         (and (in ?obj ?truck) (not (at ?obj ?loc)))
)

(:action unload-truck
	:parameters     (?truck - truck ?obj - package ?loc - location)
	:precondition   (and (at ?truck ?loc) (in ?obj ?truck))
	:effect         (and (at ?obj ?loc) (not (in ?obj ?truck)))
)

(:action drive-truck
	:parameters     (?truck - truck ?loc-from - location ?loc-to - location ?city - city)
	:precondition   (and (in-city ?truck ?loc-to ?city) (at ?truck ?loc-from) (in-city ?truck ?loc-from ?city))
	:effect         (and (at ?truck ?loc-to) (not (at ?truck ?loc-from)))
)

)

; problem
(define (problem logistics-4-0) (:domain logistics)
(:objects
obj21 - package
	obj22 - package
	obj23 - package
	apt2 - airport
	apt1 - airport
	obj11 - package
	obj13 - package
	obj12 - package
	pos1 - location
	apn1 - airplane
	tru1 - truck
	cit1 - city
	cit2 - city
	tru2 - truck
	pos2 - location
)

(:init
	(at obj23 pos2)
	(at obj12 pos1)
	(at obj13 pos1)
	(at tru2 pos2)
	(at tru1 pos1)
	(at obj22 pos2)
	(at obj21 pos2)
	(at apn1 apt2)
	(at obj11 pos1)
	(in-city tru1 pos1 cit1)
	(in-city tru2 pos2 cit2)
	(in-city tru2 apt2 cit2)
	(in-city tru1 apt1 cit1)

)

(:goal
	(and
	(at obj13 apt1)
	(at obj13 apt1)
	(at obj13 apt1)
	(at obj23 pos1)
	(at obj23 pos1)
	(at obj23 pos1)
	(at obj11 apt1)
	(at obj11 apt1)
	(at obj11 apt1)
	(at obj21 pos1)
	(at obj21 pos1)
	(at obj21 pos1)		
)
)

)

; plan
1. (load-truck tru1 obj13 pos1)
   deleted: (at obj13 pos1)
   added: (in obj13 tru1)
   goals met: 0 of 12
2. (load-truck tru1 obj11 pos1)
   deleted: (at obj11 pos1)
   added: (in obj11 tru1)
   goals met: 0 of 12
3. (load-truck tru2 obj23 pos2)
   deleted: (at obj23 pos2)
   added: (in obj23 tru2)
   goals met: 0 of 12
4. (drive-truck tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 0 of 12
5. (unload-truck tru2 obj23 apt2)
   deleted: (in obj23 tru2)
   added: (at obj23 apt2)
   goals met: 0 of 12
6. (drive-truck tru2 apt2 pos2 cit2)
   deleted: (at tru2 apt2)
   added: (at tru2 pos2)
   goals met: 0 of 12
7. (load-truck tru2 obj21 pos2)
   deleted: (at obj21 pos2)
   added: (in obj21 tru2)
   goals met: 0 of 12
8. (drive-truck tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 0 of 12
9. (unload-truck tru2 obj21 apt2)
   deleted: (in obj21 tru2)
   added: (at obj21 apt2)
   goals met: 0 of 12
10. (drive-truck tru1 pos1 apt1 cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 apt1)
   goals met: 0 of 12
11. (unload-truck tru1 obj11 apt1)
   deleted: (in obj11 tru1)
   added: (at obj11 apt1)
   goals met: 3 of 12
12. (unload-truck tru1 obj13 apt1)
   deleted: (in obj13 tru1)
   added: (at obj13 apt1)
   goals met: 6 of 12
13. (load-airplane apn1 obj23 apt2)
   deleted: (at obj23 apt2)
   added: (in obj23 apn1)
   goals met: 6 of 12
14. (load-airplane apn1 obj21 apt2)
   deleted: (at obj21 apt2)
   added: (in obj21 apn1)
   goals met: 6 of 12
15. (fly-airplane apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 6 of 12
16. (unload-airplane apn1 obj21 apt1)
   deleted: (in obj21 apn1)
   added: (at obj21 apt1)
   goals met: 6 of 12
17. (unload-airplane apn1 obj23 apt1)
   deleted: (in obj23 apn1)
   added: (at obj23 apt1)
   goals met: 6 of 12
18. (load-truck tru1 obj23 apt1)
   deleted: (at obj23 apt1)
   added: (in obj23 tru1)
   goals met: 6 of 12
19. (load-truck tru1 obj21 apt1)
   deleted: (at obj21 apt1)
   added: (in obj21 tru1)
   goals met: 6 of 12
20. (drive-truck tru1 apt1 pos1 cit1)
   deleted: (at tru1 apt1)
   added: (at tru1 pos1)
   goals met: 6 of 12
21. (unload-truck tru1 obj21 pos1)
   deleted: (in obj21 tru1)
   added: (at obj21 pos1)
   goals met: 9 of 12
22. (unload-truck tru1 obj23 pos1)
   deleted: (in obj23 tru1)
   added: (at obj23 pos1)
   goals met: 12 of 12
